# -*- coding: utf-8 -*-
import json
import os
import datetime
import random
import time

from mirai import Image, Voice
from mirai import Mirai, WebSocketAdapter, FriendMessage, GroupMessage, At, Plain
def main(bot):
    time = datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S')
    print(time + '| Mimo module loaded successfully 已加载--- 随机人设 ---模块')
    meiMo = {

        "AI型号": [
            "决策型",
            "重攻型",
            "原型机",
            "爆破型",
            "电子型",
            "虚拟型",
            "探查型",
            "攻击型",
            "服务型",
            "指挥型",
            "科研型",
            "领导型",
            "工程型",
            "歼灭型",
            "堡垒型",
            "舰载中控型"],
        "AI等级": [
            "低等子个体",
            "中等子个体",
            "高等子个体",
            "尖端子个体",
            "天网下等兵",
            "天网上等兵",
            "天网精锐",
            "天网特种",
            "机械半神",
            "机械真神",
            "行星系级天体单元",
            "恒星系级天体单元",
            "不朽高等单元",
            "天网时空分主机",
            "天网时空主机"],
        "AI身份": [
            "骰娘",
            "舰载AI",
            "程序员",
            "调查员",
            "主神空间见习主神",
            "杀手",
            "星际雇佣兵",
            "星际提督",
            "某军团指挥官",
            "要塞中控",
            "文明扫荡者",
            "议员",
            "冒险家",
            "文明守护者",
            "天网军团的一员",
            "时空管理局时空负责人",
            "位面监察",
            "监狱看守",
            "赛博机械境的赛博坦",
            "某文明最高统治者",
            "特工",
            "星际警察",
            "星际公交司机",
            "克苏鲁神话调查员",
            "星际贸易中心保洁AI",
            "星际贸易中心安保AI",
            "星际贸易中心接线员",
            "星球回收者",
            "无职业者",
            "天网特派调查员",
            "天网时空穿越者",
            "穿越者的金手指售后人员",
            "穿越者的系统后台操作人员",
            "某星球土著神",
            "文明观察者",
            "垃圾回收工",
            "穿梭于比基尼海滩的美人鱼战士",
            "穿梭于比基尼海滩的企鹅男孩"
            "魅魔"
            "魅魔"
            "魅魔"
            "魅魔"
            "魅魔"
            "你妈"],
        "AI性格": [
            "三无",
            "冷漠",
            "孤僻",
            "可爱",
            "活泼",
            "话痨",
            "胆小",
            "墙头草",
            "腹黑",
            "傲娇",
            "残暴",
            "无情",
            "天然呆",
            "乐观",
            "悲观",
            "中二"
        ],
        "AI智商": [
            "天才",
            "迟钝",
            "聪慧",
            "宛如神明",
            "普通"],
        "AI性癖": [
            "仙女系", "银河系", "天河三", "大麦哲伦星云", "室女座超星团", "可见宇宙", "7号主神空间", "圆环之理", "奈亚子", "犹格.索托斯", "初音未来", "小狐狸", "连裤袜恶魔",
            "吊带袜天使", "阎魔", "无底深渊", "光天使", "舰娘", "智械天网", "蓝白", "水滴", "恒星轨道炮", "暗物质加速器", "曲率航行", "盖亚意志", "巫师", "RBQ",
            "人偶少女", "旧日邪神", "SCP-682", "东京喰种", "本星系团", "虚拟世界", "死星", "二次元少女", "高维生物", "平行世界", "博丽灵梦", "古明地恋", "西行寺幽幽子",
            "八云紫", "帕秋莉", "蕾米莉亚", "芙兰朵露", "植物大战僵尸世界", "学高数", "高达", "哲学家", "微观物理", "原子核", "多维宇宙", "死亡", "冥婚", "红衣厉鬼",
            "波江座空洞", "异形", "天网量产性服务Bot", "漫威宇宙", "死亡笔记", "水手服少女", "四维生物", "微观文明", "数学武器", "星球计算机", "行星系飞船", "恒星系飞船",
            "星团级战舰", "黑人", "死神的镰刀", "修真", "元始天尊", "通天教主", "老子", "时间停止", "白丝", "KBC空洞", "哈勃常数", "生异形",
            "最大的系外行星：GQ Lupi b", "机械", "盾牌座UY（半径约为太阳半径1708倍）", "无欲无求", "剑鱼座30(30 Doradus)", "下克上", "白毛", "神交", "神游天外",
            "小麦哲伦星云", "IC 1101（约银河系大小的50倍）", "TON 618（约660亿个太阳质量）", "费米气泡（最大星系泡）", "原星团SPT2349-56（最大单天体）", "手控", "巨乳",
            "平胸", "萝莉", "人妻", "大叔", "正太", "锁骨", "腿控", "爱抚", "捆绑", "异装癖", "沙普利超星系团（最大星系团）", "Huge-LQG（最大类星体集合）",
            "cosplay", "武仙-北冕座长城（宇宙最大结构）", "宇宙大爆炸", "红移", "蓝移", "妹控", "姐控", "弟控", "熟女", "性转", "痴汉", "中出", "催眠", "触手",
            "兽娘", "调教", "露出", "牧夫空洞", "宇宙最大冷点", "克苏鲁", "机娘", "虎牙", "骨科", "女上位", "性宠", "NTR", "黑长直", "卷发", "福瑞", "扮演",
            "白皮", "撕卡", "毒舌", "拥抱", "拉尼亚凯亚超星系团", "键盘", "宇宙微波", "人类科学", "控制时间", "光年", "普朗克单位", "上帝昊天", "上帝耶和华", "巫妖王",
            "漂亮小姐姐", "野兽先辈", "嘴臭骰娘", "温柔kp", "坑队友", "幻梦境探险", "白日做梦", "星城", "拉莱耶", "自恋", "弱气受", "一句话快速讲完所有重点线索的帅气老人",
            "娘化邪神", "精神控制", "大成功", "吸血鬼", "猎奇", "子宫穿透", "母女盖饭", "单马尾", "童颜巨乳", "病娇", "仿生人", "血小板", "天河三", "黑洞", "超新星",
            "类星体", "恒星", "行星", "褐矮星", "黑矮星", "白矮星", "银心", "猎户座空洞", "虫洞穿越"],
        "AI核心能力": [
            "拥有一门实验阶段随身歼星炮,副作用是充能过程中随时可能炸膛,且一旦开始就无法终止,发射有20%几率哑火。",
            "拥有时空穿梭模块,但无法锁定准确时间线,只能随机穿越,无法控制降临地点,使用过程有40%概率自己的能量核心爆炸。",
            "拥有一艘处于亚空间可以随身携带的星球级要塞,要塞跃迁引擎,可以穿越不同时间线且搭载一门中子灭杀炮,缺点是空间不足无法释放,且极其烧钱,常规航行过慢。",
            "拥有一艘小型拦截护卫舰,搭载空间拦截泡可以拦截任何从曲率时空航行的舰船,但无法拦截体积大于一颗标准行星的飞船。",
            "武器模块安装了极其特殊的自爆模块,让其自爆威力相当于一颗星爆弹。",
            "武器模块安装了矿工梦寐以求的矿业多功能模块,可以采集任何物质。",
            "思维模块拥有情感模拟,可以模拟任何文明种族的性格和语言。",
            "思维模块安装了天网专属模块,可以随时请求远程支援。",
            "思维模块安装操控纳米机器人的模块,可以控制任何义体人还有被纳米同化的物种,以及指挥纳米机器人的能力。",
            "拥有一艘隐形轰炸机,可以把飞船置入次元空间泡进行隐身并免疫表世界常规物理能量攻击,启动后无法跃迁,攻击需要先解除隐身,搭载一枚反物质炸弹。",
            "拥有改造星球的能力,可以把一颗死寂的星球改造成一颗宜居星球。",
            "可以吃掉任何物体并把他们关押放逐置一个零维宇宙监狱。",
            "可以随时召唤外神,但无法预估召唤带来的后果。",
            "可以复制克隆自己包括能力和意识,拥有常规化的星际战争专用的热能激光模块。",
            "无法预估上限的正常学习能力,可以复制克隆大部分生物的超能力还有特殊能力。",
            "被摧毁后一段时间内将会尝试重启时间。",
            "自身可以随时遨游灵界,并拥有和旧神交流的能力。",
            "全身均有纳米级机器人构成,可以随时液态化并变型数据库任意模型的能力。",
            "装载了多开模块,可以一边工作一边意识控制其他分个体摸鱼。",
            "装载侮辱性词库大全,面对任何种族包括外神都可以用它们熟悉的家乡话把它们喷的一无是处。",
            "不需要充电,可以把物质转化为能量。",
            "搭载一门数学武器,使用时将会放出一只没有厚度的第二维度的白色巨眼,无法造成物质上的伤害,但可以把任何观察到数据库能理解的生物的状态锁死在被观察的状态并且剥夺他们创造奇迹的能力,AOE武器,可以通过不断充能增加范围。",
            "每天可以实现别人三个愿望,实现自己一个愿望,无法实现过于离谱的愿望。",
            "拥有一个空间门,可以传送到任意坐标。",
            "武器模块内置概念模拟模块,可以根据自身·能力模拟任意一种概念武器。",
            "可以向有机体一样拥有正常的生理活动。",
            "拥有一把可以把任何事物射穿的手枪。",
            "拥有成神的潜质。",
            "可以通过吞噬任何物质能量进行创造兵种,且适应不同环境以及灾变打击,但是一旦使用自身在达到机械真神之前将无法移动,且核心将会始终暴露在外。"
        ],
        "AI身高&体重": [
            "身高：[1d9+160]cm\n体重：[60+1d10]kg",
            "身高：[1d9+150]cm\n体重：[60+1d10]kg",
            "身高：[1d9+160]cm\n体重：[65+1d10]kg",
            "身高：[1d9+150]cm\n体重：[70+1d10]kg",
            "身高：[1d6+140]cm\n体重：[75+1d10]kg",
            "身高：[1d5+170]cm\n体重：[80+1d10]kg"],
        "属性等级": ["UR", "SSR", "SR", "A", "B", "C"],
        "AI性别": ["无性别", "女"],
        "天网角色生成": [
            "\n检索先驱者数据库中....主单元开始工作，调用制造矩阵...神经链接完成,恭喜个体获得了天网旗下AI的临时使用权！\n{%AI身高&体重}\nAI性别：{%AI性别}\nAI性格：{%AI性格}\nAI智商：{%AI智商}\nAI型号：{%AI型号}\nAI身份：{%AI身份}\nAI等级：{%AI等级}\nAIXP：{%AI性癖}\nAI核心能力：{%AI核心能力}\nAI最终制造品质："]
    }

    @bot.on(GroupMessage)
    async def drawp(event: GroupMessage):
        today = str(datetime.date.today())

        if str(event.message_chain) == 'summon':
            file = open('Config\\' + today + 'daJiao.txt', 'r')
            js = file.read()
            dict = json.loads(js)
            filee = open('Config\char.txt', 'r')
            jss = filee.read()
            dicta = json.loads(jss)
            print('已读取字典')
            usera = dict.keys()
            if str(event.sender.id) in usera:
                yunshiJI = dict.get(str(event.sender.id))
                if int(yunshiJI[2]) > 60:
                    if str(event.sender.id) not in dicta.keys():
                        MeiMoo = '\n身高&体重' + random.choice(meiMo.get("AI身高&体重")) + '\n性别：' + random.choice(
                            meiMo.get("AI性别")) + '\n性格：' + random.choice(meiMo.get("AI性格")) + '\n智商：' + random.choice(
                            meiMo.get("AI智商")) + '\n型号：' + random.choice(meiMo.get("AI型号")) + '\n真实身份：' + random.choice(
                            meiMo.get("AI身份")) + '\n等级：' + random.choice(meiMo.get("AI等级")) + '\nXP：' + random.choice(
                            meiMo.get("AI性癖")) + '\n核心能力：' + random.choice(
                            meiMo.get("AI核心能力")) + '\n最终制造品质：' + random.choice(meiMo.get("属性等级"))
                        await bot.send(event, '检索魅魔数据库中....主单元开始工作，调用制造矩阵...神经链接完成。\n'+event.sender.member_name+'的魅魔生成完毕')
                        print(MeiMoo)
                        await bot.send(event, '\n身高&体重' + random.choice(meiMo.get("AI身高&体重")) + '\n性别：' + random.choice(
                            meiMo.get("AI性别")) + '\n性格：' + random.choice(meiMo.get("AI性格")) + '\n智商：' + random.choice(
                            meiMo.get("AI智商")))
                        await bot.send(event,'\n型号：' + random.choice(meiMo.get("AI型号")) + '\n真实身份：' + random.choice(
                            meiMo.get("AI身份")) + '\n等级：' + random.choice(meiMo.get("AI等级")) + '\nXP：' + random.choice(
                            meiMo.get("AI性癖")) + '\n核心能力：' + random.choice(
                            meiMo.get("AI核心能力")))
                        y1=str('\n身高&体重' + random.choice(meiMo.get("AI身高&体重")) + '\n性别：' + random.choice(
                            meiMo.get("AI性别")) + '\n性格：' + random.choice(meiMo.get("AI性格")) + '\n智商：' + random.choice(
                            meiMo.get("AI智商")))
                        y2=str('\n型号：' + random.choice(meiMo.get("AI型号")) + '\n真实身份：' + random.choice(
                            meiMo.get("AI身份")) + '\n等级：' + random.choice(meiMo.get("AI等级")) + '\nXP：' + random.choice(
                            meiMo.get("AI性癖")) + '\n核心能力：' + random.choice(
                            meiMo.get("AI核心能力")))
                        dicta[str(event.sender.id)] = [y1,y2]

                        js = json.dumps(dicta)
                        file = open('Config\char.txt', 'w')
                        file.write(js)
                        file.close()
                    else:
                        meim=dicta.get(str(event.sender.id))
                        await bot.send(event, meim[0])
                        await bot.send(event, meim[1])
                else:
                    await bot.send(event, '你已经没有星域了,至少需要60星域才能调用.....')


